### Panda introduction

In [1]:
import pandas as pd
s = pd.Series([10, 20, 30])
print(s)

0    10
1    20
2    30
dtype: int64

In [2]:
import numpy as np
numarr1 = np.array([1, 2, 3, 4, 5])
pd.Series(numarr1, index=['a', 'b', 'c', 'd', 'e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

#### Shape introduction

In [3]:
import numpy as np
numarr1 = np.array([1, 2, 3, 4, 5])
pd.Series(numarr1, index=['a', 'b', 'c', 'd', 'e'])
series1 = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
print(series1)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
series1.shape
series1.ndim
series1.size

5

In [5]:
series1.shape

(5,)

In [6]:
series1[0:2:1]

a    10
b    20
dtype: int64

In [11]:
series1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [13]:
series1['e']

np.int64(50)

In [14]:
series2 = pd.Series([10, 20, 30], index=['1', '2', '3'])
print(series2)

1    10
2    20
3    30
dtype: int64

In [25]:
series2['3']= '2'
print(series2)

1     2
3     2
2    50
dtype: object

In [26]:
series2.index = ['a','b','c']
print(series2)

a     2
b     2
c    50
dtype: object

In [54]:
name = ['John', 'Jane', 'Doe', 'Alice', 'Bob']
age = [25, 30, 22, 28, 35]
Inc = [50000, 60000, 55000, 70000, 65000]
dict1 = {'Name': name, 'Age': age, 'Income': Inc}
print(dict1)
print(pd.DataFrame(dict1))

{'Name': ['John', 'Jane', 'Doe', 'Alice', 'Bob'], 'Age': [25, 30, 22, 28, 35], 'Income': [50000, 60000, 55000, 70000, 65000]}
    Name  Age  Income
0   John   25   50000
1   Jane   30   60000
2    Doe   22   55000
3  Alice   28   70000
4    Bob   35   65000

In [29]:
for i in range(1,6):
    print(i)

1
2
3
4
5

In [33]:
lis1 = [i for i in range(1,6)]
print(lis1)

[1, 2, 3, 4, 5]

In [55]:
df1 = pd.DataFrame(dict1)
print(df1)

    Name  Age  Income
0   John   25   50000
1   Jane   30   60000
2    Doe   22   55000
3  Alice   28   70000
4    Bob   35   65000

In [59]:
df1 = pd.DataFrame(dict1, index = [i for i in range(1,6)])
print(df1)

    Name  Age  Income
1   John   25   50000
2   Jane   30   60000
3    Doe   22   55000
4  Alice   28   70000
5    Bob   35   65000

In [61]:
name = pd.Series(['John', 'Jane', 'Doe', 'Alice', 'Bob'])
age = pd.Series([25, 30, 22, 28, 35])
Inc = pd.Series([50000, 60000, 55000, 70000, 65000])
dict3 = {'Name': name, 'Age': age, 'Income': Inc}
print(dict3)
print(pd.DataFrame(dict3))

{'Name': 0     John
1     Jane
2      Doe
3    Alice
4      Bob
dtype: object, 'Age': 0    25
1    30
2    22
3    28
4    35
dtype: int64, 'Income': 0    50000
1    60000
2    55000
3    70000
4    65000
dtype: int64}
    Name  Age  Income
0   John   25   50000
1   Jane   30   60000
2    Doe   22   55000
3  Alice   28   70000
4    Bob   35   65000

In [66]:
df = pd.DataFrame(dict1)
print(df)

    Name  Age  Income
0   John   25   50000
1   Jane   30   60000
2    Doe   22   55000
3  Alice   28   70000
4    Bob   35   65000

In [ ]:
df = df.set_index('ID')
print(df)

    Name  Age  Income
0   John   25   50000
1   Jane   30   60000
2    Doe   22   55000
3  Alice   28   70000
4    Bob   35   65000

In [69]:
df['ID'] = [1, 2, 3, 4, 5]  # Add an ID column if not present
df = df.set_index('ID')
print(df)

     Name  Age  Income
ID
1    John   25   50000
2    Jane   30   60000
3     Doe   22   55000
4   Alice   28   70000
5     Bob   35   65000

In [70]:
df.shape

(5, 3)

In [74]:
print(df.size)
print(df.columns)
print(df.index)
print(df.dtypes)
print(df.values)

15
Index(['Name', 'Age', 'Income'], dtype='object')
Index([1, 2, 3, 4, 5], dtype='int64', name='ID')
Name      object
Age        int64
Income     int64
dtype: object
[['John' 25 50000]
 ['Jane' 30 60000]
 ['Doe' 22 55000]
 ['Alice' 28 70000]
 ['Bob' 35 65000]]

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Income  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 160.0+ bytes

In [76]:
df.describe()

             Age       Income
count   5.000000      5.00000
mean   28.000000  60000.00000
std     4.949747   7905.69415
min    22.000000  50000.00000
25%    25.000000  55000.00000
50%    28.000000  60000.00000
75%    30.000000  65000.00000
max    35.000000  70000.00000

In [77]:
df.head(2)

    Name  Age  Income
ID
1   John   25   50000
2   Jane   30   60000

In [78]:
df.tail(2)

     Name  Age  Income
ID
4   Alice   28   70000
5     Bob   35   65000

In [79]:
df.reset_index(inplace=True)  # Reset index to default integer index
print(df)

   ID   Name  Age  Income
0   1   John   25   50000
1   2   Jane   30   60000
2   3    Doe   22   55000
3   4  Alice   28   70000
4   5    Bob   35   65000

In [81]:
df.nunique()

ID        5
Name      5
Age       5
Income    5
dtype: int64

In [82]:
df.sample()

   ID  Name  Age  Income
0   1  John   25   50000

In [83]:
#slicing
df[0:2]  # Slicing the first two rows

   ID  Name  Age  Income
0   1  John   25   50000
1   2  Jane   30   60000

In [84]:
#slicing
df[1:4:2]  # Slicing with step

   ID   Name  Age  Income
1   2   Jane   30   60000
3   4  Alice   28   70000

In [86]:
df['Age'] # Accessing a specific column

0    25
1    30
2    22
3    28
4    35
Name: Age, dtype: int64

In [91]:
df['Gender'] = ['Male', 'Female', 'Female','Male','Male']
print(df)

   ID   Name  Age  Income  Gender
0   1   John   25   50000    Male
1   2   Jane   30   60000  Female
2   3    Doe   22   55000  Female
3   4  Alice   28   70000    Male
4   5    Bob   35   65000    Male

In [ ]:
df.iloc[2] # Accessing a specific row by index position

ID             3
Name         Doe
Age           22
Income     55000
Gender    Female
Name: 2, dtype: object

In [93]:
df.iloc[0:2]  # Accessing rows by index position

   ID  Name  Age  Income  Gender
0   1  John   25   50000    Male
1   2  Jane   30   60000  Female

In [94]:
df.iloc[0:4:2]  # Accessing rows with step

   ID  Name  Age  Income  Gender
0   1  John   25   50000    Male
2   3   Doe   22   55000  Female

In [95]:
df.iloc[0:2,3]  # Accessing specific rows and columns

0    50000
1    60000
Name: Income, dtype: int64

In [7]:
import pandas as pd
titanic = pd.read_csv('c:/Users/Win Technology/Documents/dataset_1_Pynext.csv')
titanic

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1,0,7.2500,No
1,1st,female,38.0,1,0,71.2833,Yes
2,3rd,female,26.0,0,0,7.9250,Yes
3,1st,female,35.0,1,0,53.1000,Yes
4,3rd,male,35.0,0,0,8.0500,No
...,...,...,...,...,...,...,...
882,2nd,male,27.0,0,0,13.0000,No
883,1st,female,19.0,0,0,30.0000,Yes
884,3rd,female,7.0,1,2,23.4500,No
885,1st,male,26.0,0,0,30.0000,Yes
886,3rd,male,32.0,0,0,7.7500,No

In [106]:
titanic.describe()

              Age  Siblings/Spouses Aboard  Parents/Children Aboard       Fare
count  887.000000               887.000000               887.000000  887.00000
mean    29.471443                 0.525366                 0.383315   32.30542
std     14.121908                 1.104669                 0.807466   49.78204
min      0.420000                 0.000000                 0.000000    0.00000
25%     20.250000                 0.000000                 0.000000    7.92500
50%     28.000000                 0.000000                 0.000000   14.45420
75%     38.000000                 1.000000                 0.000000   31.13750
max     80.000000                 8.000000                 6.000000  512.32920

In [107]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Pclass                   887 non-null    object
 1   Sex                      887 non-null    object
 2   Age                      887 non-null    float64
 3   Siblings/Spouses Aboard  887 non-null    int64
 4   Parents/Children Aboard  887 non-null    int64
 5   Fare                     887 non-null    float64
 6   Survived                 887 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 48.6+ KB

In [108]:
titanic.tail(10)

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
877,3rd,male,33.0,0,0,7.8958,No
878,3rd,female,22.0,0,0,10.5167,No
879,2nd,male,28.0,0,0,10.5000,No
880,3rd,male,25.0,0,0,7.0500,No
881,3rd,female,39.0,0,5,29.1250,No
882,2nd,male,27.0,0,0,13.0000,No
883,1st,female,19.0,0,0,30.0000,Yes
884,3rd,female,7.0,1,2,23.4500,No
885,1st,male,26.0,0,0,30.0000,Yes
886,3rd,male,32.0,0,0,7.7500,No

In [110]:
titanic.head(10)

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1,0,7.2500,No
1,1st,female,38.0,1,0,71.2833,Yes
2,3rd,female,26.0,0,0,7.9250,Yes
3,1st,female,35.0,1,0,53.1000,Yes
4,3rd,male,35.0,0,0,8.0500,No
5,3rd,male,27.0,0,0,8.4583,No
6,1st,male,54.0,0,0,51.8625,No
7,3rd,male,2.0,3,1,21.0750,No
8,3rd,female,27.0,0,2,11.1333,Yes
9,2nd,female,14.0,1,0,30.0708,Yes

In [112]:
titanic['Survived'] # Accessing a specific column

0        No
1       Yes
2       Yes
3       Yes
4        No
       ...
882      No
883     Yes
884      No
885     Yes
886      No
Name: Survived, Length: 887, dtype: object

In [114]:
titanic['Survived'] == ' Yes'

0      False
1       True
2       True
3       True
4      False
       ...
882    False
883     True
884    False
885     True
886    False
Name: Survived, Length: 887, dtype: bool

In [115]:
(titanic['Survived'] == ' Yes').sum()

np.int64(342)

In [116]:
(titanic['Survived'] == 'No').sum()

np.int64(545)

In [118]:
titanic.where(titanic['Age'] < 75)

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1.0,0.0,7.2500,No
1,1st,female,38.0,1.0,0.0,71.2833,Yes
2,3rd,female,26.0,0.0,0.0,7.9250,Yes
3,1st,female,35.0,1.0,0.0,53.1000,Yes
4,3rd,male,35.0,0.0,0.0,8.0500,No
...,...,...,...,...,...,...,...
882,2nd,male,27.0,0.0,0.0,13.0000,No
883,1st,female,19.0,0.0,0.0,30.0000,Yes
884,3rd,female,7.0,1.0,2.0,23.4500,No
885,1st,male,26.0,0.0,0.0,30.0000,Yes
886,3rd,male,32.0,0.0,0.0,7.7500,No

In [5]:
titanic.query('Pclass == "1st" and Survived == " Yes"' )

NameError: name 'titanic' is not defined

In [126]:
titanic.rename(columns = {'Pclass': 'Class'}, inplace=True)  # Correcting the column name
titanic

,Class,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1,0,7.2500,No
1,1st,female,38.0,1,0,71.2833,Yes
2,3rd,female,26.0,0,0,7.9250,Yes
3,1st,female,35.0,1,0,53.1000,Yes
4,3rd,male,35.0,0,0,8.0500,No
...,...,...,...,...,...,...,...
882,2nd,male,27.0,0,0,13.0000,No
883,1st,female,19.0,0,0,30.0000,Yes
884,3rd,female,7.0,1,2,23.4500,No
885,1st,male,26.0,0,0,30.0000,Yes
886,3rd,male,32.0,0,0,7.7500,No

In [8]:
new_titanic = titanic = df
new_titanic

NameError: name 'df' is not defined

In [131]:
titanic.groupby("Survived")['Age'].count()

Survived
 Yes    342
No      545
Name: Age, dtype: int64

In [133]:
titanic['New_Fare'] = titanic['Fare']*100
titanic

,Class,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived,New_Fare
0,3rd,male,22.0,1,0,7.2500,No,725.00
1,1st,female,38.0,1,0,71.2833,Yes,7128.33
2,3rd,female,26.0,0,0,7.9250,Yes,792.50
3,1st,female,35.0,1,0,53.1000,Yes,5310.00
4,3rd,male,35.0,0,0,8.0500,No,805.00
...,...,...,...,...,...,...,...,...
882,2nd,male,27.0,0,0,13.0000,No,1300.00
883,1st,female,19.0,0,0,30.0000,Yes,3000.00
884,3rd,female,7.0,1,2,23.4500,No,2345.00
885,1st,male,26.0,0,0,30.0000,Yes,3000.00
886,3rd,male,32.0,0,0,7.7500,No,775.00

In [141]:
dict20 = {
    'Name' : ['a','v',None,'s'],
    'Age' : [10,20,30,40]
}
df3 = pd.DataFrame(dict20)
df3

   Name  Age
0     a   10
1     v   20
2  None   30
3     s   40

In [9]:
titanic.sort_values(by='Age')

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
799,3rd,male,0.42,0,1,8.5167,Yes
751,2nd,male,0.67,1,1,14.5000,Yes
641,3rd,female,0.75,2,1,19.2583,Yes
466,3rd,female,0.75,2,1,19.2583,Yes
77,2nd,male,0.83,0,2,29.0000,Yes
...,...,...,...,...,...,...,...
115,3rd,male,70.50,0,0,7.7500,No
490,1st,male,71.00,0,0,49.5042,No
95,1st,male,71.00,0,0,34.6542,No
847,3rd,male,74.00,0,0,7.7750,No
627,1st,male,80.00,0,0,30.0000,Yes